# Core CLI tools
brew "sheldon"          # Fast, configurable shell plugin manager
brew "bat"              # Better cat with syntax highlighting
brew "fzf"              # Fuzzy finder
brew "git-delta"        # Better git diff
brew "git-lfs"          # Git large file storage
brew "starship"         # Cross-shell prompt
brew "fnm"              # Fast Node Manager

# Development
brew "gh"               # GitHub CLI
brew "go"               # Go programming language
brew "uv"               # Fast Python package manager

# Docker (using Colima for lightweight Docker on macOS)
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-completion"
brew "docker-credential-helper"

# Cloud
brew "awscli"

# AI Tools
cask "claude-code"      # Anthropic's Claude CLI

# Casks (macOS GUI apps)
cask "iterm2" if OS.mac?
